-- Лабораторна робота №3
-- студентки групи КН-31 підгрупи 1
-- Бикова Валентина
-- Варіант №1

-- Мета: Набути досвіду визначення та використання функцій вищого порядку.

-- Визначте вказані функції в кожному з завдань: а)без застосування,
-- б) з застосуванням вбудованих функцій.

--Завдання 1.Переписати список справа наліво.

--а)


-- Результат тестування:
-- Prelude> 
-- >

--б)


-- Результат тестування:
-- Prelude> 
-- >

-- Завдання 2.Перемішування списку з n елементів: після першого розмістити останній,
-- після другого передостанній тощо. Наприклад вхідний список "abcde1234" має бути
-- трансформований у "a1b2c3d4e"

--а)


-- Результат тестування:
-- Prelude>  
-- >

--б)


-- Результат тестування:
-- Prelude> 
-- >

-- Висновок: під час даної лабораторної роботи я дізналась функції вищого порядку
-- та працювала з ними для вирішення поставлених задач.