-- Лабораторна робота №3
-- студентки групи КН-31 підгрупи 1
-- Бикова Валентина
-- Варіант №1

-- Мета: Набути досвіду визначення та використання функцій вищого порядку.

-- Визначте вказані функції в кожному з завдань: а)без застосування,
-- б) з застосуванням вбудованих функцій.

--Завдання 1.Переписати список справа наліво.

--а)
changes :: [a] -> [a]
changes [] = []
changes [x] = [x]
changes (x:xs) = changes xs++ [x]

-- Результат тестування:
-- Prelude> changes [1,2,3,4,5]
-- > [5,4,3,2,1]

--б)
reverses :: [a] -> [a]
reverses = reverse

-- Результат тестування:
-- Prelude> reverses "afgh123"
-- > "321hgfa"

-- Завдання 2.Перемішування списку з n елементів: після першого розмістити останній,
-- після другого передостанній тощо. Наприклад вхідний список "abcde1234" має бути
-- трансформований у "a4b3c2d1e"

--а)
mixes :: [a] -> [a]
mixes [] = []
mixes [x] = [x]
mixes (x:xs) = [x] ++ mixes(changes xs)

-- Результат тестування:
-- Prelude>  mixes [1,2,3,4,5]
-- > [1,5,2,4,3]

--б)
mixs :: [a] -> [a]
mixs [] = []
mixs [x] = [x] 
mixs (x:xs) = [x] ++ mixs(reverse xs)  

-- Результат тестування:
-- Prelude> mixs "afgh123"
-- > "a3f2g1h"

-- Висновок: під час даної лабораторної роботи я дізналась функції вищого порядку
-- та працювала з ними для вирішення поставлених задач.