-- Лабораторна робота №3
-- студентки групи КН-31 підгрупи 1
-- Бикова Валентина
-- Варіант №1

-- Мета: Ознайомитись з системою типів та класів типів. Набути досвіду визначення
-- нових типів та класів типів і їх використання.

-- 1. Фігури на площині: обчислити площу фігури.

-- 2. Публікації: визначити чи є публікація з певною назвою книги, статті або
-- тези.

-- 3. Записник: пошук інформації за іменем(телефон, дата народження, дата зустрічі).

-- Висновок: під час даної лабораторної робооти я дізналась про нові типи та 
-- класи типів, нові зазнання використала на практиці, обчислила площу фігури,
-- працювала з публікацією та з записником.