-- Лабораторна робота №1
-- студентки групи КН-31 підгрупи 1
-- Бикова Валентина
-- Варіант №1

-- Мета: Ознайомитись з основними типами мови. Ознайомитись зi структурою та
-- функцiями Glasgow Haskell Compiller. Набути навичок роботи з iнтерпретатором
-- ghci та визначення найпростiших функцiй.

-- Завдання 1. Наведіть приклади виразу вказаного типу [([Integer],[String])]. Кожен список має містити кілька
-- елементів. Перегляньте тип прикладів, як їх визначає ghci. Прокоментуйте

i=[([6,19],["fall","autumn"])]

s=[([18,15],["winter","blizzard"])]

b=[([11,16,27],["spring","cold","task"])]

-- Завдання 2. Визначте два варіанта вказаної фунції(функція приймає три числа і перевіряє, чи значення першого
-- з них знаходиться між значеннями двох інших). Перший варіант - з одним аргуменом-кортежем, другий - без 
-- використання кортежів чи списків.

function1 :: [Integer]->Bool
function1 a=a!!1<=head a && head a<=last x

function2 :: Integer->Integer->Integer->Bool
function2 a b c=b<=a && a<=c

-- Висновок: під час даної лабораторної робооти я вперше зустрілась з мовою Haskell та інтерпретатором ghci, ознайомилась
-- з основними типами мови, зі струторою та функціями мови та застосувала щойно вивчене на практиці.