-- Лабораторна робота №2
-- студентки групи КН-31 підгрупи 1
-- Бикова Валентина
-- Варіант №1

-- Мета: Набути досвіду визначення рекурсивних функцій, використання механізму
-- зіставлення зі зразком і роботи з кортежами та списками.

-- Визначте вказані функції в кожному з завдань: а)без застосування,
-- б) з застосуванням вбудованих функцій.

--Завдання 1.Знайти останній елемент списку.

--а)
last1a :: [a] -> [a]
last1a :: [] -> []
last1a :: [x1] -> [x1]
last1a :: [x1,x2] -> [x2]
last1a (x1:xs) =last1a xs

--Результат тестування:
--
--
--
--

--б)
last1b :: [a] -> [a]
last1b :: [] -> []
last1b :: [x1] -> [x1]
last1b :: [x1,x2] -> [x2]
last1b (xs) = last1a (tail xs)

--Результат тестування:
--
--
--
--

-- Завдання 2.Видалити зі списку елементи з і-го по k-й включно, напр. при і=2
-- та k=4: "asdfghj" -> "aghj".

--а)


--Результат тестування:
--
--
--
--

--б)


--Результат тестування:
--
--
--
--

-- Висновок: під час даної лабораторної робооти я дізналась про рекурсивні функції
-- та працюавла з кортежами та списками.