-- Лабораторна робота №2
-- студентки групи КН-31 підгрупи 1
-- Бикова Валентина
-- Варіант №1

-- Мета: Набути досвіду визначення рекурсивних функцій, використання механізму
-- зіставлення зі зразком і роботи з кортежами та списками.

-- Визначте вказані функції в кожному з завдань: а)без застосування,
-- б) з застосуванням вбудованих функцій.

--Завдання 1.Знайти останній елемент списку.

--а)
last1a :: [a] -> [a]
last1a [] = []
last1a [x1] = [x1]
last1a [x1,x2] = [x2]
last1a (x1:xs) = last1a xs

-- Результат тестування:
-- Prelude> last1a [1,2,3]
-- >3

--б)
last1b :: [a] -> [a]
last1b [] = []
last1b [x1] = [x1]
last1b [x1,x2] = [x2]
last1b (xs) = last1a (tail xs)

-- Результат тестування:
-- Prelude> last1b [0,2]
-- >2

-- Завдання 2.Видалити зі списку елементи з і-го по k-й включно, напр. при і=2
-- та k=4: "asdfghj" -> "aghj".

--а)
drop' :: Int -> [a] -> [a]
drop' _ []     = []
drop' 0 xs     = xs
drop' n (_:xs) = drop' (n-1) xs

take' :: Int -> [a] -> [a]
take' n _ | n <= 0 = []
take' _ [] = []
take' n (x:xs)  =  x : take' (n-1) xs

slice :: Int -> Int -> [a] -> [a]
slice from to xs = take' (from - 1) xs ++ drop' to xs

-- Результат тестування:
-- Prelude>  slice 1 2 [1,2,3,4,5]
-- [3,4,5]

--б)
v1 :: ([a], Int, Int) -> ([a], Int, Int)
v1 (xs, a, b) = if a < b then (let(ys,zs) = splitAt a xs in ys ++ tail zs,a,b)
else (xs,a,b)

-- Результат тестування:
-- Prelude>  v1 ([1,2,3,4,5], 1,2)
-- ([1,3,4,5],1,2)

-- Висновок: під час даної лабораторної робооти я дізналась про рекурсивні функції
-- та працюавла з кортежами та списками.